In [1]:
x=10
y=20
import numpy as np
np.log(x)

2.302585092994046

In [2]:
import pandas as pd
import matplotlib as plt

In [5]:
data=pd.read_csv("C:\\Users\\CHANDU\\Downloads\\mba.csv")
#here pd is pandas and data is the variable that is used to store

In [6]:
data.shape
# to get dimensions of dataframe that is no of rows and columns

(773, 3)

In [7]:
data.columns
#gives column names

Index(['datasrno', 'workex', 'gmat'], dtype='object')

In [8]:
#access through column name
#using dot
data.workex

0       21
1      107
2       57
3       99
4      208
      ...
768     88
769    132
770     28
771     10
772     52
Name: workex, Length: 773, dtype: int64

In [9]:
data.gmat

0      720
1      640
2      740
3      690
4      710
      ...
768    620
769    670
770    610
771    610
772    620
Name: gmat, Length: 773, dtype: int64

In [10]:
#using[]
data['workex']

0       21
1      107
2       57
3       99
4      208
      ...
768     88
769    132
770     28
771     10
772     52
Name: workex, Length: 773, dtype: int64

In [11]:
data['gmat']

0      720
1      640
2      740
3      690
4      710
      ...
768    620
769    670
770    610
771    610
772    620
Name: gmat, Length: 773, dtype: int64

In [12]:
#access the columns using indexing
data.iloc[:,2]

0      720
1      640
2      740
3      690
4      710
      ...
768    620
769    670
770    610
771    610
772    620
Name: gmat, Length: 773, dtype: int64

In [13]:
#access a particular row
data.iloc[0,:]
#where 0 is the first row and only : gives all columns

datasrno      1
workex       21
gmat        720
Name: 0, dtype: int64

In [14]:
data.head()
#gives first 5 rows

   datasrno  workex  gmat
0         1      21   720
1         2     107   640
2         3      57   740
3         4      99   690
4         5     208   710

In [15]:
data.tail()
#gives last 5 rows

     datasrno  workex  gmat
768       769      88   620
769       770     132   670
770       771      28   610
771       772      10   610
772       773      52   620

In [16]:
data.head(10)
#gives first 10 rows same applies for data.tail(10) gives last 10 rows

   datasrno  workex  gmat
0         1      21   720
1         2     107   640
2         3      57   740
3         4      99   690
4         5     208   710
5         6     136   660
6         7      70   660
7         8     103   710
8         9      79   700
9        10      22   730

In [24]:
#remove columns and rows from dataframe
data.drop(data.index[0:1])
#to remove multiple rows
#if axis= 1 then it will remove column if axis=0 then remove row

     datasrno  workex  gmat
1           2     107   640
2           3      57   740
3           4      99   690
4           5     208   710
5           6     136   660
..        ...     ...   ...
768       769      88   620
769       770     132   670
770       771      28   610
771       772      10   610
772       773      52   620

[772 rows x 3 columns]

In [25]:
data.drop("datasrno",axis="columns")
#this will not remove datasrno from existing dataframe but it will not show datasrno column

     workex  gmat
0        21   720
1       107   640
2        57   740
3        99   690
4       208   710
..      ...   ...
768      88   620
769     132   670
770      28   610
771      10   610
772      52   620

[773 rows x 2 columns]

In [26]:
data.drop("datasrno",axis='columns', inplace=True)
#if we use this then the above particular column used in code will removed from the original dataframe

if we have to create new dataframe then no need to use inplace=True we can use
data1=data.drop("datasrno",axis='columns')